pmo-dataset/variations/graphviz_with_ids/53.dot
digraph G {
  rankdir=LR;  
  node [shape=box];

  "Task_1" [label="MSPN sends a\ndismissal to MSPO"];
  "Task_2" [label="MSPO reviews the\ndismissal"];
  "Task_3" [label="MSPO rejects the\ndismissal of the\nMSPN"];
  "Task_4" [label="MSPO confirms the\ndismissal of the\nMSPN"];
  "StartNoneEvent_1" [shape=circle, label=""];
  "EndNoneEvent_1" [shape=circle, penwidth=4, label=""];
  "ExclusiveGateway_1" [shape=diamond, label="X"];
  "ExclusiveGateway_2" [shape=diamond, label="X"];

  "StartNoneEvent_1" -> "Task_1";
  "Task_1" -> "Task_2";
  "Task_2" -> "ExclusiveGateway_1";
  "ExclusiveGateway_1" -> "Task_3";
  "ExclusiveGateway_1" -> "Task_4";
  "Task_3" -> "ExclusiveGateway_2";
  "Task_4" -> "ExclusiveGateway_2";
  "ExclusiveGateway_2" -> "EndNoneEvent_1";
}
